docs/acl/acl-bench-results/raw/S13/getset_with_100_users.txt
ERROR: ERR admin permission required to perform the command
ERROR: failed to fetch CONFIG from 127.0.0.1:7772
WARN: could not fetch server CONFIG
====== SET ======
  20000 requests completed in 2.83 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= 0.6 milliseconds
0.01% <= 0.8 milliseconds
0.03% <= 0.9 milliseconds
0.03% <= 1.0 milliseconds
0.07% <= 1.1 milliseconds
0.14% <= 1.2 milliseconds
0.27% <= 1.3 milliseconds
0.42% <= 1.4 milliseconds
0.57% <= 1.5 milliseconds
0.77% <= 1.6 milliseconds
1.06% <= 1.7 milliseconds
1.48% <= 1.8 milliseconds
1.95% <= 1.9 milliseconds
2.67% <= 2 milliseconds
12.10% <= 3 milliseconds
23.58% <= 4 milliseconds
37.27% <= 5 milliseconds
51.44% <= 6 milliseconds
63.38% <= 7 milliseconds
72.75% <= 8 milliseconds
79.83% <= 9 milliseconds
85.36% <= 10 milliseconds
89.13% <= 11 milliseconds
92.25% <= 12 milliseconds
94.38% <= 13 milliseconds
95.78% <= 14 milliseconds
96.80% <= 15 milliseconds
97.47% <= 16 milliseconds
97.92% <= 17 milliseconds
98.13% <= 18 milliseconds
98.35% <= 19 milliseconds
98.64% <= 20 milliseconds
98.82% <= 21 milliseconds
98.99% <= 22 milliseconds
99.06% <= 23 milliseconds
99.08% <= 24 milliseconds
99.14% <= 25 milliseconds
99.28% <= 26 milliseconds
99.48% <= 27 milliseconds
99.57% <= 28 milliseconds
99.62% <= 29 milliseconds
99.65% <= 30 milliseconds
99.67% <= 31 milliseconds
99.68% <= 32 milliseconds
99.71% <= 33 milliseconds
99.73% <= 34 milliseconds
99.74% <= 36 milliseconds
99.75% <= 37 milliseconds
99.83% <= 38 milliseconds
99.85% <= 39 milliseconds
99.86% <= 40 milliseconds
99.94% <= 41 milliseconds
99.97% <= 42 milliseconds
100.00% <= 49 milliseconds
100.00% <= 50 milliseconds
7057.16 requests per second

====== GET ======
  20000 requests completed in 1.67 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.22% <= 1 milliseconds
26.03% <= 2 milliseconds
60.08% <= 3 milliseconds
77.31% <= 4 milliseconds
86.82% <= 5 milliseconds
91.77% <= 6 milliseconds
94.82% <= 7 milliseconds
96.48% <= 8 milliseconds
97.79% <= 9 milliseconds
98.44% <= 10 milliseconds
98.95% <= 11 milliseconds
99.15% <= 12 milliseconds
99.30% <= 13 milliseconds
99.55% <= 14 milliseconds
99.68% <= 15 milliseconds
99.85% <= 16 milliseconds
99.90% <= 17 milliseconds
99.92% <= 18 milliseconds
99.97% <= 19 milliseconds
100.00% <= 21 milliseconds
100.00% <= 22 milliseconds
12004.80 requests per second